Revit 2027 API
ElevationMarker.GetViewId Method
 Returns the ViewSection id for the index of the ElevationMarker.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetViewId(
	int index
)
Public Function GetViewId (
	index As Integer
) As ElementId
public:
ElementId^ GetViewId(
	int index
)
member GetViewId :
        index : int -> ElementId
Parameters
index Int32
 The index of the ElevationMarker for which a ViewSection id will be returned.
Return Value
ElementId
 ViewSection id of the view at the ElevationMarker index, invalid element id otherwise.
Exceptions
Exception | Condition
ArgumentException |  The index index is out of range for this ElevationMarker.
See Also
Reference
ElevationMarker Class
Autodesk.Revit.DB Namespace